Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: གང་གི་ཚེ་གནས་བརྟན་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེ། བདག་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལགས་སོ། །སྨྲས་པ།
en: “When the elder fully awakens to unsurpassed and perfect buddhahood, I too will fully awaken.”

source: ཁོ་བོ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ནི་གནས་མེད་སྐབས་མེད་དོ། །སྨྲས་པ།
en: “It is impossible and unthinkable that I should fully awaken to buddhahood.”

source: དེ་དེ་ལྟ་ལགས་ཏེ།
en: “That is true.

source: བྱང་ཆུབ་ནི་གནས་མ་མཆིས་པ་ལ་གནས་པ་སྟེ།
en: Awakening cannot be found in any location.

source: དེ་ནི་སུས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ལགས་སོ།
en: Therefore, no one at all could fully awaken to buddhahood.”

source: །བུ་མོ་དེས་བསྟན་པ་འདི་བཤད་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: When the maiden gave this teaching, five hundred bodhisattvas reached the acceptance that phenomena are unborn.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་བུ་མོ་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One expressed his approval of the maiden, saying “Excellent.

source: བུ་མོ་ལེགས་སོ་ལེགས་སོ།
en: Excellent.

source: །ཁྱོད་ཀྱིས་ཆོས་བསྟན་པ་འདི་ལེགས་པར་སྨྲས་སོ།། །།བམ་པོ་དྲུག་པ།
en: Your teaching was well spoken.”

source: དེ་ནས་འཁོར་དེའི་ནང་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། བུ་མོ་འདི་ཡུན་ཇི་སྲིད་ཅིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་སྙམ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་དགེ་སློང་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: A few of the gods, nāgas, yakṣas, and gandharvas in the assembly then wondered, “How long will it take for this woman to fully awaken to unsurpassed and perfect buddhahood?”

source: དགེ་སློང་དག་བུ་མོ་རིན་ཆེན་སྣ་ཚོགས་ཅན་འདི་ནི་བསྐལ་པ་གྲངས་མེད་པ་སུམ་བརྒྱ་ན་བསྐལ་པ་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཅན་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་རྣམ་པར་གཟིགས་ཞེས་བྱ་བར་འགྱུར་རོ།
en: The Blessed One read their minds, and so addressed his monks, “Monks, after three hundred countless eons, during the eon called Purified, in the world of Light , the lady Adorned with Various Jewels will become the thus-gone, worthy, perfect Buddha Samantavipaśyin

source: །འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཅན་དེ་ཡང་དེ་བཞིན་གཤེགས་པ་དེའི་འོད་ཀྱིས་རྟག་ཏུ་སྣང་བར་འགྱུར་རོ།
en: The world Light will always be illuminated by the light of this thus-gone one.

source: །ཞབས་འབྲིང་བ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་སུ་འགྱུར་རོ།
en: There will be 9 0 million bodhisattva attendants.

source: །དེའི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཅུར་འགྱུར་རོ།
en: The lifespan of this thus-gone one will be ten intermediate eons.”

source: །དེ་ནས་ཀླུའི་བུ་མོ་ཁྲི་པོ་དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་པར་གཟིགས་དེས་བྱང་ཆུབ་བརྙེས་པ་དེའི་ཚེ། བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་གསོལ་ནས།
en: Then the ten thousand nāga women made the aspiration before the Blessed One, “Blessed One, may we be born in that world when the Thus-Gone One Samantavipaśyin attains awakening!”

source: དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེ་བར་ལུང་བསྟན་ཏོ།
en: The Blessed One then prophesied that they would be born into that world.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་འདི་དག་ནི་ལྷ་མ་ཡིན་གྱིས་འཇིགས་པས་རྟག་ཏུ་སྐྲག་བཞིན་དུ་གནས་ལ།
en: Śakra, lord of the gods, then said to the Blessed One, “Blessed One, the gods in the Heaven of the Thirty-Three live in constant fear and anxiety over the asuras.

source: ལྷ་དང་ལྷ་མ་ཡིན་གཡུལ་འགྱེད་པ་ན་ཡང་ཕན་ཚུན་རྩོད་ཅིང་འགྱེད་པར་བགྱིད་དེ།
en: When the gods and asuras make war, there is mutual argument and fighting.

source: དེ་བས་ན་བཅོམ་ལྡན་འདས། དེ་བཞིན་གཤེགས་པས་ཅི་ནས་སེམས་ཅན་ཐམས་ཅད་སེམས་འཐུན་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཆོས་བསྟན་ན་ལེགས་སོ་ལེགས་སོ།
en: Therefore, Blessed One, if the Thus-Gone One could give a teaching that would help all beings to be harmonious, it would be excellent!

source: །འཁོར་འདིར་ལྷ་དང་ལྷ་མ་ཡིན་འདུས་པ་འདི་དག་ཐམས་ཅད་ཀྱང་། ཅི་ནས་གཅིག་ལ་གཅིག་འཐུན་པར་བགྱིད་པ་དང་། བྱམས་པར་སེམས་པ་དང་། ཕན་པར་སེམས་པ་དང་། གནོད་པར་སེམས་པར་མི་འགྱུར་བ་དེ་ལྟ་བུར་སེམས་དད་པར་བཅོམ་ལྡན་འདས་ཀྱིས་མཛད་དུ་གསོལ།
en: Blessed One, please see to it that all the gods and asuras contained in this assembly are harmonious toward one another, loving, helpful, and not malicious under any circumstances. Help our minds to be faithful!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་བདེ་མཆོག་དང་། ཐགས་ཟངས་རིས་དང་། ལག་བཟངས་དང་། སིམ་བྱེད་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then addressed the lords of the asuras Rāhu, Supreme Bliss, Vemacitrin, Subāhu, and Satisfier:

source: གྲོགས་པོ་དག་བྱམས་པ་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྔགས་སོ།
en: “Friends, love is praised by all the buddhas.

source: །བྱམས་པའི་རྗེས་སུ་འཇུག་པའི་སྐྱེས་བུ་གང་ཟག་གིས་ནི་ཚེ་འདི་དང་། ཚེ་ཕྱི་མའི་དོན་ཐོབ་པར་འགྱུར་རོ།
en: Beings who live according to the dictates of love achieve benefit in this and future lives.

source: །གྲོགས་པོ་དག་ཚེ་འདི་ནི་ཡུན་ཐུང་ངོ་། །ཚེ་ཕྱི་མར་ནི་འགྲོ་དགོས་སོ། །འབྱོར་པ་ཐམས་ཅད་ཀྱི་མཐའ་ནི་རྒུད་པའོ།
en: Friends, this life is short, and one must move on to the next. All of one's wealth is lost in the end.

source: །རྒྱལ་པོའི་ལོངས་སྤྱོད་དང་དབང་ཕྱུག་རྣམས་ནི་མི་རྟག་གིས་ཁྱེད་ལྷན་ཅིག་འཐུན་པ་དང་གནོད་སེམས་མེད་པ་དང་། འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པས་གནས་པར་གྱིས་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལྟར་ཅི་ནས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་། ལྷ་མ་ཡིན་དེ་དག་འཐུན་པར་གནས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་སྐྱོ་བའི་གཏམ་མཛད་དོ།
en: Kingly enjoyment and power are impermanent, so I encourage you to be harmonious with one another, to abandon malice, to keep the next life in mind, and to trust in the ripening of karma.” In that way the Blessed One gave a heartfelt sermon, which encouraged the gods of the Heaven of the Thirty-Three and the asuras to live in harmony.

source: །དེ་ནས་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་དེང་སླན་ཆད་མཉེན་པའི་ཚུལ་དུ་བགྱིད་ཅིང་གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་དང་གནོད་སེམས་མ་མཆིས་པས་གནས་པར་འཚལ་ལོ།
en: They said, “Blessed One, we agree to henceforth act kindly and be loving and not malicious toward one another.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One continued, “Friends, this is excellent, excellent.

source: །བྱམས་པའི་རྣམ་པའི་སེམས་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཆོད་པའི་མཆོག་ཡིན་ནོ།
en: A loving mind is the finest way to venerate the Thus-Gone One.

source: །རྫས་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་རྣམས་ཀྱིས་མཆོད་པས་ནི་འདི་ལྟ་སྟེ། བྱམས་པའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་དེ་མཆོག་ཡིན་ཏེ།
en: Veneration with objects that generate merit and are fashioned from material things cannot compare to absorption in the loving mind.

source: ངས་དེ་ལས་དགོངས་ནས་དེ་སྐད་བསྟན་ཏོ།
en: Understanding this myself, I teach it accordingly.

source: །གྲོགས་པོ་དག་གཞན་ཡང་བཞི་པོ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཁྱད་པར་དུ་འཕགས་པ་ཡིན་ཏེ།
en: Furthermore, friends, these four are extraordinary ways to venerate the thus-gone ones.

source: བསླབ་པ་ལས་འགལ་བར་མི་བྱེད་པ་དང་། བྱམས་པའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་འཆད་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་ལ་སོ་སོར་རྟོག་པའི་ཆོས་ཀྱི་ནན་ཏན་ཏེ།
en: They are not contradicting the trainings; actions of a loving body, speech, and mind; the mind set on awakening aimed at ensuring the survival of the lineage of the Three Jewels; and rigorously contemplating whatever Dharma one has heard.

source: བཞི་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཁྱད་པར་དུ་འཕགས་པའོ།
en: These four are extraordinary ways to venerate the thus-gone ones.”

source: །བསྟན་པ་འདི་ཐོས་ནས་ལྷའི་འཁོར་དང་ལྷ་མ་ཡིན་གྱི་འཁོར་དེ་དག་གི་ནང་ནས་བཞི་ཁྲིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When the assemblies of gods and asuras heard this teaching, forty thousand of them developed the mind set on awakening.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་དབུགས་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་དབུགས་ཅན་ཆེན་པོ་དང་། འཇོག་པོ་དང་། ཁ་དོག་མཐའ་ཡས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོ་འདིའི་ནང་ན་ཀླུའི་རིགས་ཚད་མ་མཆིས་པ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་སྣ་ཚོགས་ལས་སྐྱེས་པ་དག་མཆིས་ཏེ།
en: The nāga kings Breath , Great Breath, Takṣaka, and Infinite Color said to the Blessed One, “Blessed One, in this ocean there are infinite classes of nāgas who have originated from a diversity of karmic ripening.

source: དེ་ལ་ཁ་ཅིག་ནི་དབང་ཆེར་གྲགས་པ་ལགས།
en: Some are known for their power.

source: ཁ་ཅིག་ནི་ལུས་ཉམ་ཆུང་ཞིང་ཆུང་བར་གྲགས་ལ་ལུས་ཆུང་བ་དག་ཀྱང་མཆིས་ཏེ།
en: Some are known to be weak and feeble in body, so there are also those with smaller bodies.

source: བཅོམ་ལྡན་འདས་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་བཞི་དེར་བབས་ནས་ཀླུ་གཞོན་ནུ་དང་། ཀླུའི་བུ་མོ་ལུས་ཉམ་ཆུང་བ་རྣམས་བཏོན་ཏེ་འཚལ་བར་བགྱིད་ལ། རྒྱ་མཚོའི་ནང་གི་ཀླུའི་རིགས་ཐམས་ཅད་ཀྱང་སྐྲག་པར་བགྱིད་ལགས་ན།
en: Blessed One, the four garuḍas, those kings of birds, prey upon us and take away our young nāga boys and girls who are physically weak, thus causing fear among all classes of nāgas within the ocean.

source: ཅི་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ཀླུ་དེ་དག་ཐམས་ཅད་ཀྱང་འཇིགས་པ་མ་མཆིས་པ་དང་། སྐྲག་པ་མ་མཆིས་པར་གནས་པར་འགྱུར་བ་དེ་ལྟ་བུར་བཅོམ་ལྡན་འདས་ཀྱིས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བ་མཛད་དུ་གསོལ།
en: Thus we implore the Blessed One to guard, protect, and conceal all the nāgas in the ocean so we can live without fear and anxiety.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རས་ཕྲག་ཟར་ཕྲག་པ་ལས་ཕབ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ། ཀྱེ་ཀླུའི་བདག་པོ་རས་ཕྲག་ཟར་འདི་ལོང་ལ།
en: Taking the shawl from his shoulder, the Blessed One said to Nāga King Sāgara, “Nāga Lord, take this shawl.

source: ཀླུའི་རིགས་ཐམས་ཅད་དང་། ཀླུའི་གནས་ཐམས་ཅད་དུ་དུམ་བུ་དུམ་བུར་གཤེགས་ཏེ་བྱིན་ཅིག་དང་། ཇི་སྲིད་དུ་རས་ཕྲག་ཟར་འདི་ལས་ཐ་ན་ཉག་མ་གཅིག་ཙམ་གནས་པ་དེ་སྲིད་དུ། ཡང་རྒྱ་མཚོ་ཆེན་པོར་ནམ་མཁའ་ལྡིང་ཐམས་ཅད་རྒྱུ་བར་མི་འགྱུར་རོ།
en: Take pieces of it to all the classes and abodes of the nāgas. Wherever a single strand of this shawl lies in this ocean, the garuḍas will not go.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་དང་ལྡན་པའི་མཆོག་གི་ཐུགས་ཀྱིས་སྨོན་པ་ནི་འགྲུབ་པའི་ཕྱིར་རོ།
en: Because, Nāga Lord, aspirations made by the supreme mind of the disciplined Thus-Gone One are always fulfilled.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་རས་ཕྲག་ཟར་འདི་ལྟར་ཆུང་བ་འདི་རྒྱ་མཚོ་ཆེན་པོའི་ཀླུ་ཐམས་ཅད་ཀྱིས་ཇི་ལྟར་ཐོབ་པར་འགྱུར་སྙམ་སྟེ་ཞུམ་པར་གྱུར་ཏོ།
en: The nāga kings were worried as they wondered how every nāga in the ocean could possibly receive a piece of this small shawl.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་དེ་རྣམས་ཀྱི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རས་ཕྲག་ཟར་འདི་ལས་དུམ་བུ་དུམ་བུར་ཁྱེར་དུ་ཟིན་ཀྱང་རས་ཕྲག་ཟར་འདི་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་ཏེ།
en: The Blessed One knew the thoughts of the nāga kings, and so he said to Nāga King Sāgara, “Nāga Lord, even if every single being in the worlds of the great trichiliocosm were to carry off a piece from this shawl, the shawl would not be used up.

source: དེ་དག་གིས་གོས་ཇི་ཙམ་གྱི་ཚད་དུ་འགྱུར་བར་འདོད་ན་ཡང་དེ་ལས་དེ་དག་གི་གོས་དེ་ཙམ་དུ་འགྱུར་ཏེ།
en: One can take as much fabric from it as one could wish for.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ནི་དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: This is how inconceivable the blessings of the Thus-Gone One are.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་རས་ཕྲག་ཟར་དེ་བླངས་ཏེ།
en: Nāga King Sāgara then took the shawl.

source: དུམ་བུ་འབུམ་ཕྲག་དུ་མར་བྱས་ནས་ཀླུ་ཐམས་ཅད་དང་ཀླུ་གཞོན་ནུ་ཐམས་ཅད་ལ་སོ་སོར་བྱིན་ནོ།
en: Cutting it into hundreds of thousands of pieces, he distributed it to each adult and child nāga.

source: །དེར་སུ་ཇི་ཙམ་དུ་འདོད་པ་དེ་ལ་དེ་ཙམ་གྱི་གོས་སུ་མངོན་པར་འགྲུབ་པར་འགྱུར་ཏེ།
en: The cloth was blessed such that each received as much as they desired.

source: ཡངས་ཤིང་རྒྱ་ཆེ་བར་འགྱུར་ལ། རས་ཕྲག་ཟར་དེ་ཡང་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་རོ།
en: The shawl also grew vast and wide and never ran out.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཀླུའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ལ་སྨྲས་པ། གྲོགས་པོ་དག་རས་ཕྲག་ཟར་དེ་ལ་སྟོན་པའི་འདུ་ཤེས་དང་། མཆོད་རྟེན་གྱི་འདུ་ཤེས་སྐྱེད་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Nāga King Sāgara then addressed the nāga kings, “Friends, think of this shawl as the Teacher and use it as a support for your veneration. Why should you do so?

source: རས་ཕྲག་ཟར་འདི་ནི་དེ་བཞིན་གཤེགས་པས་ལོངས་སྤྱད་པ་ཡིན་ཏེ།
en: Because this shawl was used by the Thus-Gone One.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་ནོ།
en: It is therefore a support for venerating him that all beings can use.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱེད་པ་གང་ཡིན་པ་དང་། རས་ཕྲག་ཟར་འདི་ལ་མཆོད་པ་བྱེད་པ་གང་ཡིན་པ་དེ་ལ་ནི་བྱེ་བྲག་ཏུ་བྱ་བའམ། ཐ་དད་དུ་བྱ་བ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: Friends, there is not the slightest distinction or difference to be made between venerating this shawl and venerating the Thus-Gone One himself.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then expressed his approval to Nāga King Sāgara, “Nāga Lord, excellent.

source: ཀླུའི་བདག་པོ་ལེགས་སོ་ལེགས་སོ།
en: Excellent.

source: །ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ།
en: It is exactly as you have described:

source: རས་ཕྲག་ཟར་དེ་ལ་མཆོད་པ་བྱེད་པ་གང་ཡིན་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་པ་ཡིན་ནོ།
en: every act of venerating this shawl is an act of veneration toward the Thus-Gone One himself.

source: །ཀླུའི་བདག་པོ་ཀླུ་དང་། ཀླུ་གཞོན་ནུ་དང་། ཀླུའི་བུ་མོ་ཇི་སྙེད་ཀྱིས་རས་ཕྲག་ཟར་དེ་ལས་དུམ་བུ་དུམ་བུར་ཁྱེར་བ་མཐོང་ངམ།
en: Nāga lord, did the adult nāgas, the boy nāgas, and the girl nāgas all see the pieces being taken from the shawl?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་དག་ཐམས་ཅད་ནི་བསྐལ་པ་བཟང་པོ་འདི་ཁོ་ན་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ངས་ལུང་བསྟན་ཏེ། ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་རྣམས་ནི་མ་གཏོགས་སོ།
en: The Blessed One said, “I prophesy that each of them will reach parinirvāṇa during this Fortunate Eon, purely by following the Great Vehicle.

source: །ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟར་འཇིག་རྟེན་ན་ཡོན་གནས་ཡིན་ཏེ།
en: Nāga Lord, the Thus-Gone One is in this way the locus of veneration in this world.

source: དེ་ལ་སེམས་གཅིག་བསྐྱེད་པ་ཙམ་ཡང་ཆུད་ཟ་བར་མི་འགྱུར་རོ།
en: If one thinks of him just once, it will not be in vain.”

source: །དེ་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཀླུ་དང་། ཀླུ་གཞོན་ནུ་དང་། ཀླུའི་བུ་མོ་ཇི་སྙེད་གནས་པ་དེ་དག་ཐམས་ཅད་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས།
en: All the nāgas in the ocean—adults, boys, and girls— were satisfied, happy, delighted, joyful, and at ease.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ཏེ་ཚིག་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ནི་གཉིས་སུ་མི་གསུང་བའོ།
en: They touched the feet of the Blessed One and said, “The Thus-Gone One does not speak falsely.

source: །དེ་བཞིན་གཤེགས་པ་ནི་བདེན་པ་གསུང་བའོ།
en: The Thus-Gone One speaks the truth.

source: །ཡང་དག་པར་གསུང་བའོ།
en: He speaks truthfully.

source: །ཕྱིན་ཅི་མ་ལོག་པར་གསུང་བ་སྟེ།
en: He does not speak mistakenly.

source: དེས་བདག་ཅག་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ལུང་བསྟན་ཏོ།
en: So he prophesied that we would all reach parinirvāṇa.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་སངས་རྒྱས་དང་ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ཤིན་ཏུ་སྐྱབས་སུ་མཆིའོ།
en: Blessed One, we take refuge in the Buddha, the Dharma, and the Saṅgha of monks.

source: །བསླབ་པའི་གཞི་རྣམས་ཀྱང་གཟུང་བར་འཚལ་ལོ།
en: We promise to take up the bases of training.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་བཀའ་དྲིན་དུ་གཟོ་བར་འཚལ་ཏེ།
en: We promise to repay the kindness of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པ་བཞུགས་པ་ན་ཡང་བལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་བསྙེན་བཀུར་བགྱི་བ་དང་། ཆོས་མཉན་པའི་སླད་དུ་རྒྱུན་མི་འཆད་པར་ཐད་དུ་མཆིའོ།
en: When the Thus-Gone One is alive, we will come right away to behold, prostrate, serve, and listen to the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་ཡང་སྐུ་གདུང་འཆང་བ་རྣམས་ལ་མཆོད་པ་བགྱིའོ།
en: Even after the Thus-Gone One passes into parinirvāṇa, we will venerate the receptacle of his relics.

source: །བཀུར་སྟི་དང་། རིམ་གྲོ་ཐམས་ཅད་ཀྱང་བགྱིའོ།
en: We will serve and honor the Thus-Gone One in all ways.”

source: །ཀླུ་ཡོངས་སུ་བསྐྱབ་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བདུན་པའོ།།
en: Chapter Seven: The Protection of the Nāgas

source: །།དེ་ནས་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་བཞིས་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་འདི་ཐོས་ནས་མི་དགའ་ཞིང་།
en: The four garuḍas, the kings of the birds, heard of the Thus-Gone One’s blessing and were displeased.

source: རིངས་པའི་ཚུལ་གྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: With due haste, they made their way to where the Blessed One was.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་གི་འཚལ་མ་བཀུམ་སྟེ་ཅི་བགྱི་ལགས།
en: Arriving, they bowed their heads before the Blessed One, encircled him three times, and asked, “Blessed One, if we do not kill our prey, what shall we do?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་ཟས་བཞི་པོ་འདི་དག་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བར་འགྱུར་བ་ཡིན་ཏེ།
en: The Blessed One answered, “Friends, four types of food will lead one to be reborn as a hell being, an animal, or a resident of the realms of the Lord of Death.

source: གྲོགས་པོ་དག་ཟས་གང་སྲོག་ཆགས་གཞན་བསད་པ་དང་། སྲོག་ཆགས་གཞན་ལ་རྣམ་པར་འཚེ་བ་དང་། གཞན་གྱི་སྲོག་བཅད་པས་འཚོ་བ་འདི་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བར་འགྱུར་བའི་ཟས་དང་པོའོ།
en: Friends, any food that involves taking a being’s life, harming another being, or supporting oneself through taking the life of another is the first type of food that will lead one to be reborn as a hell being, an animal, or a resident of the realms of the Lord of Death.

source: །གྲོགས་པོ་དག་གཞན་ཡང་ཟས་གང་མ་བྱིན་པར་ལེན་ཅིང་འཕྲོག་པ་དང་། གཞན་གྱི་ལོངས་སྤྱོད་འཇིག་པར་བྱེད་པ་དང་། དབྱུག་པ་དང་། རལ་གྲི་དང་། མཚོན་ཆ་དང་། ལག་ཆས་འཚོག་པ་འདི་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བར་འགྱུར་བའི་ཟས་གཉིས་པའོ།
en: Furthermore, friends, any food that involves stealing, destroying another’s livelihood, or striking someone with a club, sword, weapon, or tool is the second type of food that will lead one to be reborn as a hell being, an animal, or a resident of the realms of the Lord of Death.

source: །གྲོགས་པོ་དག་གཞན་ཡང་ཟས་གང་ཚུལ་འཆོས་པ་དང་། ཁ་གསག་དང་། ཕ་རོལ་ལ་གནོད་པ་བྱེད་པ་དང་། སྤྱོད་ལམ་ཡང་དག་པར་སྟོན་པ་དང་། ཆོ་ག་ཉམས་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་དང་། ལྟ་བ་ཉམས་པ་དང་། འཚོ་བ་ཉམས་པ་དང་། ལོག་པ་དང་། ཡང་དག་པ་མ་ཡིན་པའི་ཡོན་ཏན་གྱིས་འཚོ་བ་འདི་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བའི་ཟས་གསུམ་པའོ།
en: Friends, any food that involves deceit, disrespect, or harming another, or that involves making a show of having genuine conduct while having degenerate behavior, discipline, view, livelihood, or wrong and inappropriate qualities is the third type of food that will lead one to be reborn as a hell being, an animal, or a resident of the realms of the Lord of Death.

source: །གྲོགས་པོ་དག་གཞན་ཡང་ཟས་གང་སྟོན་པ་མ་ཡིན་པ་ལ་སྟོན་པར་ཁས་འཆེ་བ་དང་། ཡང་དག་པར་སོང་བ་མ་ཡིན་པ་ལ་ཡང་དག་པར་སོང་བར་ཁས་འཆེ་བ་དང་། དགེ་སྦྱོང་མ་ཡིན་པར་དགེ་སྦྱོང་དུ་ཁས་འཆེ་བ་དང་། ཚངས་པར་སྤྱོད་པ་མ་ཡིན་པར་ཚངས་པར་སྤྱོད་པར་ཁས་འཆེ་བས་འཚོ་བ་འདི་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བར་འགྱུར་བའི་ཟས་བཞི་པ་སྟེ།
en: Friends, any food that involves falsely claiming to be a teacher when one is not, claiming to be living appropriately when one is not, claiming to be a mendicant when one is not, or claiming to observe pure conduct when one is not, is the fourth type of food that will lead one to be reborn as a hell being, an animal, or a resident of the realms of the Lord of Death.

source: གྲོགས་པོ་དག་ང་ནི་ཟས་བཞི་པོ་འདི་དག་ཡང་དག་པར་གཅད་པའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: Friends, I can teach the Dharma because I have genuinely desisted from partaking of these four types of food.

source: གྲོགས་པོ་དག་ལུས་གསོ་བའི་ཕྱིར་གཞན་གྱི་སྲོག་གཅད་པར་མི་བྱའོ།
en: “Friends, to sustain one’s body, one should not take the lives of others.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ནི་སྲོག་གཅེས་ཤིང་ཕངས་པའི་ཕྱིར་ཏེ།
en: Because all beings cherish and prize their lives.

source: གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་བདག་ཉིད་བསྲུང་བའི་ཕྱིར་དང་། འཇིག་རྟེན་ཕ་རོལ་བསྲུང་བའི་ཕྱིར་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་སྦྱིན་པའི་ཕྱིར་མཁས་པས་སྲོག་གི་ཕྱིར་ཡང་གཞན་གྱི་སྲོག་མི་གཅོད་ཅིང་། བྱ་བ་མ་ཡིན་པ་ཐམས་ཅད་མི་བྱའོ།
en: Therefore, friends, in order to protect oneself, to protect one’s next life, and to bring all beings happiness, learned persons should never take the lives of others or do anything untoward, even at the cost of their own lives.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་བཞི་གཡོག་ས་ཡ་ས་ཡ་དང་ལྡན་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་དེ་བཞིན་གཤེགས་པ་དང་། ཆོས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: Then the four garuḍas, the kings of the birds, with each of their millions of servants, said to the Blessed One, “Blessed One, we take refuge in the Thus-Gone One, the Dharma, and the Saṅgha of monks.

source: །སྔོན་སྡིག་པའི་ལས་བགྱིས་པ་ཡང་སོ་སོར་བཤགས་སོ།
en: We confess our previous misdeeds.

source: །སླན་ཆད་ཀྱང་སྡོམ་པར་འཚལ་ལོ།
en: Henceforth, we accept these vows:

source: །ཀླུའི་རིགས་ཐམས་ཅད་ལ་ཡང་མི་འཇིགས་པ་སྩལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱི་དམ་པའི་ཆོས་ཡུན་ཇི་སྲིད་གནས་པ་དེ་སྲིད་དུ་ཡང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ལ་བརྩོན་པར་བགྱིའོ།
en: we will avoid scaring any class of nāga, and we will, for as long as the Blessed One’s sublime Dharma remains, continuously exert ourselves in venerating the Thus-Gone One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་བཞི་པོ་དེ་དག་ལ་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་ཁྱེད་ནི་དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་ཀྱི་གསུང་རབ་ལ། དགེ་སློང་བཞིར་གྱུར་ཏེ། དགའ་བྱེད་དང་། དགའ་བྱེད་ཆེན་པོ་དང་། བླ་མ་དང་། བླ་མའི་བཤེས་གཉེན་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: In turn the Blessed One said to the four garuḍas, the kings of the birds, “Friends, in the scriptures of the Thus-Gone One Kanakamuni, you four were monks named Nanda , Mahānanda, Superior, and Superior Teacher.

source: །དགེ་སློང་བཞི་པོ་དེ་དག་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པའི་རྒྱགས་པས་མྱོས་ཤིང་མཛའ་བཤེས་ཀྱི་ཁྱིམ་དང་། སློངས་མོ་སྟེར་བའི་ཁྱིམ་གྱི་རྒྱགས་པས་མྱོས་ལ་བདག་ཉིད་ནི་ཚུལ་ཁྲིམས་དང་། ཆོ་ག་དང་། ལྟ་བ་ཉམས་པས།
en: The four monks grew intoxicated with arrogance at their material gain, honor, and fame. They also grew intoxicated with arrogance at their relatives’ houses and the houses that distribute alms, and their discipline, behavior, and views were degenerate.

source: ཚུལ་ཁྲིམས་དང་ལྡན་པའི་དགེ་སློང་རྣམས་ལ་ནི་འཁྲུག་པ་དང་། གནོད་པ་བྱས་ཏེ།
en: Because of this, they disturbed and did harm to the disciplined monks.

source: ལུས་དང་ངག་དང་། ཡིད་མ་བསྡམས་ཤིང་སྡིག་པ་མང་པོ་བྱས་པར་གྱུར་ཏོ།
en: In this way, they did not restrain their body, speech, and mind but engaged in many misdeeds.

source: །དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་དེ་ལ་ཡང་དེ་དག་གིས་མཆོད་པ་མང་པོ་བྱས་སོ།
en: Still, these four monks nevertheless offered much service to the Thus-Gone One Kanakamuni.

source: །དེས་ན་ཁྱེད་སེམས་ཅན་དམྱལ་བར་མ་སོང་སྟེ། དུད་འགྲོའི་སྐྱེ་གནས་འདིར་སྐྱེས་ནས་འདི་ལྟར་སྡོམ་པས་མ་བསྡམས་པའི་ཕྱིར།
en: Therefore, you did not go to hell but instead took birth here in the animal realm.

source: ཁྱོད་ཀྱིས་སྲོག་གཅོད་པ་མང་དུ་བྱས་ཤིང་སྡིག་པའི་ལས་མང་དུ་བྱས་ལ།
en: Because previously you did not restrain yourselves, you have now taken many lives and engaged in many negative actions.

source: མང་པོ་དག་ཀྱང་འཇིགས་པར་བྱས་སོ།
en: You have frightened many beings.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་བཞི་པོ་དེ་དག་གིས་ཅི་ནས་ཚེ་རབས་དྲན་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་དེ་དང་དེར་དགེ་སྦྱོང་དུ་གྱུར་ནས་ལས་མངོན་པར་འདུ་བྱེད་པ།
en: The Blessed One then created a miracle that enabled the four garuḍas, the kings of the birds, to remember their past lives in that moment.

source: མངོན་པར་འདུས་བྱས་པ་དེ་དག་ཐམས་ཅད་རྗེས་སུ་དྲན་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པ་མཛད་དོ།
en: Thus they were able to remember being monks with the Thus-Gone One Kanakamuni and to recall the karma they accumulated.
